/*19.	Введіть з клавіатури і виведіть на екран одну букву російського алфавіту. 
У разі введення не російською букви надрукуйте повідомлення про помилку на екрані і завершіть виконання програми.
Жуков Андрій 12.10.2019*/
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	unsigned char a;
	cout << "Введите букву руского алфавита" << endl;
	cin >> a;

	if (((int)a <= 192) || (a >= 255))
		cout << "Ошибка!!!!!! Введен не правильный символ";
	system("pause");
	return 0;
}