/*1.	Напишіть оголошення статичної змінної - члена.*/
#include <iostream>

using namespace std;

// оголошення класу, що містить статичний член даних
class CPi
{
public:
	static double Pi; // статичний член даних - константа
};

// оголошення статичної змінної за межами класу з одночасною ініціалізацією
static double Exp = 2.7182818284; // експонента

// ініціалізація статичного члена класу CPi
double CPi::Pi = 3.141592653589793;

// неініціалізовані статичні змінні, значення яких = 0 (за замовчуванням)
static double ZeroD;
static int ZeroI;
static char ZeroC;

int* pZ; // зовнішній покажчик на int

int _tmain()
{
	double d;
	CPi obj; // об'єкт класу
	double* pPi; // покажчик на double
	double* pExp; // покажчик на double

	// покажчик вказує на статичний член даних об'єкту obj класу CPi
	pPi = &obj.Pi;
	pExp = &::Exp; // вказує на статичний член даних Exp - інший вид доступу через ::

	// перевірка
	d = obj.Pi; // d = 3.14159
	d = Exp; // d = 2.71828
	d = ::Exp; // d = 2.71828 - так теж можна
	d = *pPi; // d = 3.14159

	// зовнішній покажчик на int
	pZ = &ZeroI;
	d = *pZ; // d = 0

	*pZ = 5;
	d = ZeroI; // d = 5

	return 0;
}